akafugu/akafugu_core/src/boards.txt

##############################################################

akafugubread.name=Akafugu Breadboard Adapter (Internal 8MHz Clock)

akafugubread.upload.tool=arduino:avrdude
akafugubread.upload.protocol=arduino
akafugubread.upload.maximum_size=30720
akafugubread.upload.speed=57600

akafugubread.bootloader.tool=arduino:avrdude
akafugubread.bootloader.low_fuses=0xe2
akafugubread.bootloader.high_fuses=0xD8
akafugubread.bootloader.extended_fuses=0x05
akafugubread.bootloader.file=arduino:atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex
akafugubread.bootloader.unlock_bits=0x3F
akafugubread.bootloader.lock_bits=0x0F

akafugubread.build.mcu=atmega328p
akafugubread.build.f_cpu=8000000L
akafugubread.build.board=AKAFUGU_BREAD
akafugubread.build.core=arduino:arduino
akafugubread.build.variant=arduino:standard

##############################################################

akafugubread16.name=Akafugu Breadboard Adapter (External 16MHz Clock)

akafugubread16.upload.tool=arduino:avrdude
akafugubread16.upload.protocol=arduino
akafugubread16.upload.maximum_size=32256
akafugubread16.upload.speed=115200

akafugubread16.bootloader.tool=arduino:avrdude
akafugubread16.bootloader.low_fuses=0xff
akafugubread16.bootloader.high_fuses=0xde
akafugubread16.bootloader.extended_fuses=0x05
akafugubread16.bootloader.file=arduino:optiboot/optiboot_atmega328.hex
akafugubread16.bootloader.unlock_bits=0x3F
akafugubread16.bootloader.lock_bits=0x0F

akafugubread16.build.mcu=atmega328p
akafugubread16.build.f_cpu=16000000L
akafugubread16.build.board=AKAFUGU_BREAD16
akafugubread16.build.core=arduino:arduino
akafugubread16.build.variant=arduino:standard

##############################################################

akafuinol.name=Akafuino L
akafuinol.vid.0=0x16D0
akafuinol.pid.0=0x06BC
akafuinol.upload.tool=arduino:avrdude
akafuinol.upload.protocol=avr109
akafuinol.upload.maximum_size=28672
akafuinol.upload.maximum_data_size=2560
akafuinol.upload.speed=57600
akafuinol.upload.disable_flushing=true
akafuinol.upload.use_1200bps_touch=true
akafuinol.upload.wait_for_upload_port=true

akafuinol.bootloader.tool=arduino:avrdude
akafuinol.bootloader.low_fuses=0xff
akafuinol.bootloader.high_fuses=0xd8
akafuinol.bootloader.extended_fuses=0xcb
akafuinol.bootloader.file=caterina/Caterina-L.hex
akafuinol.bootloader.unlock_bits=0x3F
akafuinol.bootloader.lock_bits=0x2F

akafuinol.build.mcu=atmega32u4
akafuinol.build.f_cpu=16000000L
akafuinol.build.vid=0x16D0
akafuinol.build.pid=0x06BC
akafuinol.build.usb_product="Akafugu L"
akafuinol.build.usb_manufacturer="Akafugu"
akafuinol.build.board=AKAFUGU_L
akafuinol.build.core=arduino:arduino
akafuinol.build.variant=arduino:leonardo
akafuinol.build.extra_flags={build.usb_flags}

##############################################################

simpleclock.name=Akafugu SimpleClock

simpleclock.upload.tool=arduino:avrdude
simpleclock.upload.protocol=arduino
simpleclock.upload.maximum_size=30720
simpleclock.upload.maximum_data_size=2048
simpleclock.upload.speed=57600

simpleclock.bootloader.tool=arduino:avrdude
simpleclock.bootloader.low_fuses=0xFF
simpleclock.bootloader.high_fuses=0xDA
simpleclock.bootloader.extended_fuses=0x05
simpleclock.bootloader.file=arduino:atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex
simpleclock.bootloader.unlock_bits=0x3F
simpleclock.bootloader.lock_bits=0x0F

simpleclock.build.mcu=atmega328p
simpleclock.build.f_cpu=8000000L
simpleclock.build.board=AKAFUGU_SIMPLECLOCK
simpleclock.build.core=arduino:arduino
simpleclock.build.variant=arduino:standard

##############################################################

nixieclock.name=Akafugu Nixie Clock

nixieclock.upload.tool=arduino:avrdude
nixieclock.upload.protocol=arduino
nixieclock.upload.maximum_size=30720
nixieclock.upload.maximum_data_size=2048
nixieclock.upload.speed=57600

nixieclock.bootloader.tool=arduino:avrdude
nixieclock.bootloader.low_fuses=0xe2
nixieclock.bootloader.high_fuses=0xD8
nixieclock.bootloader.extended_fuses=0x05
nixieclock.bootloader.file=arduino:atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex
nixieclock.bootloader.unlock_bits=0x3F
nixieclock.bootloader.lock_bits=0x0F

nixieclock.build.mcu=atmega328p
nixieclock.build.f_cpu=8000000L
nixieclock.build.board=AKAFUGU_NIXIECLOCK
nixieclock.build.core=arduino:arduino
nixieclock.build.variant=arduino:standard

